/***********************************Copy Left*****************************************
文件名：    hal_spi.h
文件描述：  SPI1初始化
创建时间：  2023/03/01
修改时间： 
修改内容；

***************************************************************************************/
#ifndef _HAL_KEY_H_
#define _HAL_KEY_H_	 

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f103xb.h"

// SPI总线速度设置 
#define SPI_SPEED_2     0
#define SPI_SPEED_8     1
#define SPI_SPEED_16    2
#define SPI_SPEED_256   3

/****************************************************************
***函数名称：HAL_SPI1_Init
***函数功能：SPI1初始化
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void HAL_SPI1_Init(void);

/****************************************************************
***函数名称：HAL_SPI1_ReadWriteByte
***函数功能：SPI1发送一个字节
***输入参数：byte, 要发送的字节
***返回值：读取到的字节
***备注：
*****************************************************************/
unsigned char HAL_SPI1_ReadWriteByte(unsigned char byte);

		 
#ifdef __cplusplus
}
#endif

#endif



