/***********************************Copy Left*****************************************
文件名：    dal_iic.h
文件描述：  IIC驱动
创建时间：  2023/03/02
修改时间： 
修改内容；

***************************************************************************************/
#ifndef _DAL_IIC_H_
#define _DAL_IIC_H_	 

#ifdef __cplusplus
extern "C" {
#endif

#include "hal_iic.h"

/****************************************************************
***函数名称：DAL_IIC_Init
***函数功能：IIC驱动初始化
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void DAL_IIC_Init(void);

/****************************************************************
***函数名称：DAL_IIC_Start
***函数功能：产生IIC起始信号
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void DAL_IIC_Start(void);

/****************************************************************
***函数名称：DAL_IIC_Stop
***函数功能：产生IIC停止信号
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void DAL_IIC_Stop(void);

/****************************************************************
***函数名称：DAL_IIC_WaitAck
***函数功能：等待应答信号到来
***输入参数：无
***返回值：1，接收应答失败
           0，接收应答成功
***备注：无
*****************************************************************/
unsigned char DAL_IIC_WaitAck(void);

/****************************************************************
***函数名称：DAL_IIC_Ack
***函数功能：产生ACK应答
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void DAL_IIC_Ack(void);

/****************************************************************
***函数名称：DAL_IIC_Nack
***函数功能：不产生ACK应答		
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void DAL_IIC_Nack(void);

/****************************************************************
***函数名称：DAL_IIC_SendByte
***函数功能：发送一个字节		
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void DAL_IIC_SendByte(unsigned char byte);


/****************************************************************
***函数名称：DAL_IIC_ReadByte
***函数功能：读1个字节，ack=1时，发送ACK，ack=0，发送nACK   		
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
unsigned char DAL_IIC_ReadByte(unsigned char ack);


#ifdef __cplusplus
}
#endif

#endif


