/***********************************Copy left*****************************************
文件名：    main.h
文件描述：  主函数头文件
创建时间：  2023/02/28
修改时间： 
修改内容；

***************************************************************************************/
#ifndef _MAIN_H_
#define _MAIN_H_

#ifdef __cplusplus
extern "C" {
#endif

/****************************************************************
***函数名称：SystemInit
***函数功能：系统时钟初始化
***输入参数：无
***返回值：无
***备注：此函数被启动文件中调用
*****************************************************************/
void SystemInit(void);


#ifdef __cplusplus
}
#endif

#endif 
