/***********************************Copy left*****************************************
文件名：    task.h
文件描述：  任务注册
创建时间：  2023/02/28
修改时间： 
修改内容；

***************************************************************************************/

#ifndef _TASK_H_
#define _TASK_H_

typedef enum 
{
	TASK_TIME_5MS = 5,
    TASK_TIME_10MS = 10,
    TASK_TIME_20MS = 20,
    TASK_TIME_50MS = 50,
    TASK_TIME_100MS = 100,
	TASK_TIME_120MS = 120,
	TASK_TIME_150MS = 150,
	TASK_TIME_200MS = 200,
	TASK_TIME_250MS = 250,
	TASK_TIME_500MS = 500,
	TASK_TIME_970MS = 970,
	TASK_TIME_1000MS = 1000,
}TASK_RUM_TIME_E;           // 任务运行时间枚举


/****************************************************************
*函数名称：TaskInit
*函数功能：任务初始化
*输入参数：无
*返回值：无
*备注：无
*****************************************************************/
void TaskInit(void);

/****************************************************************
*函数名称：TaskRegister
*函数功能：任务注册函数
*输入参数：task，需要注册的任务，taskTime，任务时间
*返回值：无
*备注：任务时间以1ms为基准
*****************************************************************/
void TaskRegister(void (*task)(void), unsigned short taskTime);

/****************************************************************
*函数名称：TaskStart
*函数功能：任务开始
*输入参数：无
*返回值：无
*备注：无
*****************************************************************/
void TaskStart(void);


#endif 
