/***********************************Copy Left*****************************************
文件名：    dal_usart3.c
文件描述：  串口3初始化
创建时间：  2023/03/01
修改时间： 
修改内容；

***************************************************************************************/
#include "dal_usart3.h"


/****************************************************************
***函数名称：DAL_Usart3Init
***函数功能：串口3初始化
***输入参数：baud, 波特率
***返回值：无
***备注：无
*****************************************************************/
void DAL_Usart3Init(unsigned int baud)
{
    HAL_Usart3Init(baud);
}

/****************************************************************
***函数名称：DAL_Usart3SendByte
***函数功能：串口3发送数据
***输入参数：byte，发送一个字节
***返回值：无
***备注：无
*****************************************************************/
void DAL_Usart3SendByte(unsigned char byte)
{
    HAL_Usart3SendByte(byte);
}
