/***********************************Copy Left*****************************************
文件名：    hal_spi.c
文件描述：  SPI1初始化
创建时间：  2023/03/01
修改时间： 
修改内容；

***************************************************************************************/
#include "dal_spi.h"

/****************************************************************
***函数名称：DAL_SPI1_Init
***函数功能：SPI1初始化
***输入参数：无
***返回值：无
***备注：无
*****************************************************************/
void DAL_SPI1_Init(void)
{	 
    HAL_SPI1_Init();
}   

/****************************************************************
***函数名称：DAL_SPI1_ReadWriteByte
***函数功能：SPI1发送一个字节
***输入参数：byte, 要发送的字节
***返回值：读取到的字节
***备注：
*****************************************************************/
unsigned char DAL_SPI1_ReadWriteByte(unsigned char byte)
{		
	return HAL_SPI1_ReadWriteByte(byte);  
}































